import { headerData, footerData, landingSubjectsData } from './menu-data';
export const instanceData = {
  lang: "hi",
  headerData: headerData,
  footerData: footerData,
  strings: {
    header: {
      slogan: "ओपन लर्निंग प्लेटफॉर्म",
      search: "खोजें",
      login: "लॉग इन करें"
    },
    search: {
      privacy: "खोज गूगल द्वारा प्रदान की गई है। क्या जानकारी संसाधित है, यह जानने के लिए हमारी%privacypolicy% देखें।",
      agree: "सहमत"
    },
    footer: {
      summaryHeading: "Serlo.org सीखने की विकिपीडिया है",
      summaryText: "हम महान शिक्षा को हर किसी के लिए स्वतंत्र रूप से उपलब्ध कराने के लिए अथक रूप से काम करने वाले दूरदर्शी समुदाय का एक समुदाय हैं",
      learnMore: "और जानें",
      participate: "कारण में शामिल हों",
      donate: "दान करें",
      toTop: "ऊपर"
    },
    categories: {
      articles: "लेख",
      courses: "पाठ्यक्रम",
      videos: "वीडियो",
      applets: "एप्लेट",
      folders: "फ़ोल्डर्स",
      exercises: "अभ्यास",
      events: "कार्यक्रम"
    },
    entities: {
      applet: "एप्लेट",
      article: "लेख",
      course: "पाठ्यक्रम",
      coursePage: "अध्ययन पृष्ठ",
      event: "कार्यक्रम",
      exercise: "अभ्यास",
      exerciseGroup: "व्यायाम समूह",
      folder: "फोल्डर",
      groupedExercise: "समूह व्यायाम",
      page: "पृष्ठ",
      solution: "हल",
      taxonomyTerm: "टैक्सोनोमी शब्द",
      user: "उपयोगकर्ता",
      video: "वीडियो",
      topicFolder: "अभ्यास फोल्डर",
      comment: "टिप्पणियां",
      revision: "संशोधन",
      thread: "धागा",
      threads: "थ्रेडस",
      topic: "विषय",
      subject: "विषय",
      userProfile: "यूज़र प्रोफाइल",
      privacyPolicy: "गोपनीयता नीति",
      content: "सामग्री"
    },
    pageTitles: {
      notifications: "आपकी सूचनाएं",
      subscriptions: "सदस्यताओं को प्रबंधित करें",
      revisionHistory: "संशोधन इतिहास"
    },
    roles: {
      donor: "दाताओं",
      author: "लेखक",
      reviewer: "समीक्षक"
    },
    share: {
      button: "सांझा करें",
      title: "सांझा करें",
      copyLink: "लिंक कॉपी करें",
      copySuccess: "लिंक कॉपी किया गया!",
      close: "बंद करें"
    },
    edit: {
      button: "संपादित करें",
      unrevised: "अप्रकाशित संशोधन दिखाएं"
    },
    license: {
      readMore: "सूचना",
      special: "अलग लाइसेंस",
      nonFree: "इस सामग्री का उपयोग हमारी अन्य सामग्री की तुलना में अधिक प्रतिबंधित हो सकता है।"
    },
    course: {
      showPages: "पाठ्यक्रम का अवलोकन करें",
      pages: "पाठ्यक्रम अवलोकन",
      next: "अगला"
    },
    content: {
      show: "दिखाएँ",
      hide: "छिपाएं",
      prerequisite: "इस कार्य के लिए आपको निम्नलिखित बुनियादी ज्ञान की आवश्यकता है",
      task: "कार्य",
      right: "सही!",
      wrong: "गलत",
      check: "जाँच करें",
      yourAnswer: "आपका उत्तर",
      chooseOption: "किसी एक विकल्प पर क्लिक करें",
      trashedNotice: "यह सामग्री हटाने के लिए चिह्नित है",
      strategy: 'Solution Strategy',
      picture: 'Picture'
    },
    consent: {
      title: "बाहरी सामग्री के लिए सहमति",
      intro: "इस साइट का उपयोग करते समय आप हमें बाहरी प्रदाताओं से सामग्री लोड करने की अनुमति दे सकते हैं। आप विवरण के बारे में पढ़ सकते हैं %privacypolicy%.",
      revokeTitle: "वापस लेना",
      revokeText: "यहां आप अपनी सहमति रद्द कर सकते हैं। इस मामले में, हम उन प्रदाताओं से सामग्री लोड करने से पहले फिर से पूछते हैं",
      noConsent: "कोई सामग्री सहेजी नहीं गई।",
      revokeConsent: "सहमति रद्द करें"
    },
    embed: {
      text: "ऊपर की छवि या बटन पर क्लिक करके आप सहमत होते हैं कि%provider%  से बाहरी सामग्री लोड हो जाएगी। इसके अलावा व्यक्तिगत डेटा हमारे% privacypolicy% के अनुसार इस सेवा में स्थानांतरित किया जा सकता है।",
      video: "से वीडियो चलाएं %provider%",
      applet: "%provider% से लोड एप्लेट ",
      twingle: "लोड दान प्रपत्र"
    },
    comments: {
      question: "क्या आपका कोई प्रश्न है?",
      commentsOne: "टिप्पणी:",
      commentsMany: "टिप्पणियां",
      submit: "जमा करें",
      archiveThread: "आर्काइव थ्रेड",
      restoreThread: "थ्रेड को पुनर्स्थापित करें",
      deleteThread: "थ्रेड मिटाएं",
      deleteComment: "टिप्पणी हटाएँ",
      postedOn: "इस दिन पोस्ट हुआ",
      placeholder: "आपका प्रश्न या सुझाव",
      placeholderReply: "आपका उत्तर",
      loading: "टिप्पणियों की तलाश में ...",
      error: "क्षमा करें, टिप्पणियां लोड नहीं की जा सकीं, कृपया बाद में पुनः प्रयास करें।",
      showMoreReply: "एक और उत्तर दिखाओ",
      showMoreReplies: " %number% और उत्तर दिखाएं",
      showArchived: "संग्रहीत दिखाएँ %threads%",
      copyLink: "टिप्पणी लिंक कॉपी करें"
    },
    revisions: {
      toOverview: "अवलोकन पर वापस जाएं",
      toContent: "Back to content",
      changes: "परिवर्तन",
      title: "शीर्षक",
      content: "सामग्री",
      metaTitle: "मेटा शीर्षक",
      metaDescription: "मेटा विवरण",
      compare: "तुलना करें",
      currentVersion: "वर्तमान संस्करण",
      thisVersion: "यह संस्करण",
      currentNotice: "यह वर्तमान में स्वीकृत संस्करण है।",
      rejectedNotice: 'This revision was rejected.',
      by: "द्वारा"
    },
    revisionHistory: {
      changes: "परिवर्तन",
      author: "लेखक",
      date: "दिनांक",
      createNew: "इस विशिष्ट संशोधन से प्रारंभ एक नया संशोधन बनाएं"
    },
    errors: {
      title: "😬 वेबसाइटें कभी-कभी गलतियाँ करती हैं",
      defaultMessage: "क्षमा करें, हमें इस सामग्री को लोड करने में समस्या है।",
      temporary: "च्छी खबर? समस्या अस्थायी लगती है, इसलिए कृपया बाद में पुनः प्रयास करें।",
      permanent: "हम देखेंगे कि हम उसके बारे में क्या कर सकते हैं",
      typeNotSupported: "कृपया इस पृष्ठ को पुनः लोड करने का प्रयास करें",
      refreshNow: "अब ताज़ा करें",
      backToPrevious: "पिछले पृष्ठ पर जाएँ",
      backToHome: "होमपेज पर जाएं"
    },
    print: {
      warning: "महत्वपूर्ण: सभी चित्र और सूत्र प्रिंट करने के लिए, कृपया इस संवाद को खोलने से पहले पृष्ठ के अंत में नीचे स्क्रॉल करें। धन्यवाद!"
    },
    profiles: {
      aboutMe: "मेरे बारे में",
      activeSince: 'With Serlo since',
      recentActivities: "हाल की गतिविधि",
      showAllActivities: "समस्त गतिविधयाँ दिखाएँ",
      lastLogin: 'Last login',
      roles: "भूमिकाएं",
      instanceRoles: 'Roles on %lang%.serlo.org:',
      otherRoles: 'Other roles:',
      directMessage: 'Direct message',
      howToEditImage: {
        heading: 'How to edit your profile picture',
        description: 'Currently we use the images from %chatUrl% as profile pictures. In order to change your picture, do the following:',
        steps: {
          goToChat: 'Go to %chatUrl%.',
          signIn: 'Sign in.',
          goToMyAccount: 'Go in the user menu to %myAccountLink%.',
          myAccount: 'My Account',
          uploadPicture: 'Upload a new picture and click "Save changes".'
        }
      }
    },
    notices: {
      welcome: "आपका स्वागत है",
      bye: "👋जल्द ही मिलते हैं!",
      revisionSaved: "संशोधन सहेजा गया है और जल्द ही इसकी समीक्षा की जाएगी 👍",
      revisionAccepted: "संशोधन को सफलतापूर्वक स्वीकार कर लिया गया ✅",
      revisionRejected: "संशोधन को सफलतापूर्वक अस्वीकार कर दिया गया ❎",
      revisionSavedAccepted: "संशोधन सफलतापूर्वक सहेजा गया और स्वीकार किया गया  ✅"
    },
    loading: {
      isLoading: "सामग्री लोड हो रही है ...",
      unknownProblem: "क्षमा करें, सामग्री लोड करने में समस्या थी, कृपया बाद में पुनः प्रयास करें।"
    },
    login: {
      pleaseLogInLink: "कृपया लॉगिन करें",
      pleaseLogInText: "इस सुविधा का उपयोग करने के लिए"
    },
    keys: {
      ctrl: 'ctrl',
      return: "वापसी"
    }
  }
};
export const instanceLandingData = {
  lang: "hi",
  subjectsData: landingSubjectsData,
  strings: {
    vision: "हम नॉनप्रॉफिट आर्गेनाइजेशन संगठन हैं जो व्यक्तिगत शिक्षा का समर्थन करते हैं और समान शैक्षणिक अवसरों के लिए काम करते हैं। यह सीखने का मंच दुनिया भर के लाखों छात्रों के लिए हजारों निर्देशक लेख, वीडियो के माध्यम से सीखना और अभ्यास प्रदान करता है - पूरी तरह से नि: शुल्क। अब हिंदी में हमसे जुड़ने का समय है।",
    learnMore: "और जानो",
    democraticallyStructured: "लोकतांत्रिक",
    nonProfit: "नॉनप्रॉफिट",
    transparent: "पारदर्शक",
    openlyLicensed: "खुले तौर पर लाइसेंस प्राप्त",
    adFree: "विज्ञापन मुक्त",
    freeOfCharge: "निःशुल्क",
    wikiTitle: "सेर्लो सीखने के लिए विकिपीडिया है।",
    wikiText: "विकिपीडिया की तरह, यह मंच लेखकों के एक व्यस्त समुदाय द्वारा बनाया गया है। सेर्लो शिक्षा पूरी दुनिया में स्वयंसेवकों और पेशेवरों की विकेन्द्रीकृत टीमों द्वारा संचालित और स्वामित्व में है।",
    movementTitle: "ओपन एजुकेशन के लिए हमारे आंदोलन का एक हिस्सा बनें",
    callForAuthors: "हम उत्साही शिक्षकों की तलाश में हैं जो अपने विषय के बारे में भावुक हैं। Serlo.org पर एक लेखक बनें! आप नई सीखने की सामग्री बना सकते हैं और मौजूदा सामग्री को बेहतर बनाने में हमारी सहायता कर सकते हैं।",
    communityLink: "लेखकों के लिए लैंडिंग पृष्ठ पर जाएं",
    callForOther: "हम सॉफ्टवेयर विकास, डिजाइन, अनुवाद, संचार, परियोजना प्रबंधन और अन्य क्षेत्रों के क्षेत्र में नौकरियों और स्वयंसेवी अवसरों की विविध श्रेणी प्रदान करते हैं।",
    getInvolved: "सेर्लो में शामिल हो जाएं"
  }
};
export const serverSideStrings = {
  title: "सेर्लो के साथ सीखें!"
};
export const loggedInData = {
  authMenu: [{
    url: '/user/notifications',
    title: "सूचनाएँ",
    icon: 'notifications'
  }, {
    url: '',
    title: "उपयोगकर्ता",
    icon: 'user',
    children: [{
      url: '/user/public',
      title: 'Own profile'
    }, {
      url: '/auth/password/change',
      title: "पासवर्ड परिवर्तित करें"
    }, {
      url: '/event/history/user/me',
      title: "हाल की गतिविधि"
    }, {
      url: '/subscriptions/manage',
      title: "सब्सक्रिप्शन"
    }, {
      url: '/api/auth/logout',
      title: "लॉगआउट करें"
    }]
  }],
  strings: {
    tools: "अन्य टूल",
    authorMenu: {
      log: "लॉग",
      settings: "सेटिंग्स",
      moveCoursePage: "इस पृष्ठ को दूसरे कोर्स में ले जाएं",
      thisCoursePage: "यह कोर्स पृष्ठ",
      addCoursePage: "कोर्स पृष्ठ जोड़ें",
      wholeCourse: "पूरे कोर्स",
      copyItems: "आइटम कॉपी करें",
      moveItems: "आइटम ले जाएं",
      addGroupedTextExercise: "समूहीकृत-पाठ-व्यायाम",
      changeLicense: "लायसेंस परिवर्तित करें",
      subscribe: "सदस्य बनें",
      subscribeNotifications: "सूचनाएं प्राप्त करें",
      subscribeNotificationsAndMail: "ईमेल के माध्यम से सूचनाएं प्राप्त करें ।",
      unsubscribeNotifications: "सदस्यता रद्द",
      convert: "धर्मांतरित (बीटा)",
      history: "इतिहास",
      editAssignments: "विषय और पाठ्यचर्या असाइनमेंट संपादित करें",
      moveToTrash: "रद्दी में डालें",
      restoreContent: "कचरे से पुनर्स्थापित करें",
      sort: "सोर्ट चिल्ड्रन",
      edit: "संपादित",
      organize: "आयोजन",
      moveToGroupedTextExercise: "सामग्री को अन्य समूहीकृत-पाठ-व्यायाम में ले जाएँ",
      moveToTextExercise: "सामग्री को अन्य पाठ-व्यायाम में ले जाएँ",
      sortEntities: "सामग्री को क्रमबद्ध करें",
      newEntity: "नई इकाई",
      editProfile: "प्रोफ़ाइल संपादित करें"
    },
    notifications: {
      loadMore: "अधिक लोड करें",
      hide: "इस सामग्री के लिए सूचनाएं छिपाएँ।",
      setToRead: "Set notification to read.",
      setAllToRead: "Set all visible to read",
      showNew: "New",
      showRead: "Read",
      setThreadStateArchived: "%actor% संग्रहीत %thread%.",
      setThreadStateUnarchived: "%actor% बहाल %thread%.",
      createComment: "%actor% में टिप्पणी की %thread%: %comment%.",
      createThread: "%actor% शुरू %thread% पर %object%.",
      createEntity: "%actor% बनाया था %object%.",
      setLicense: "%actor% का लाइसेंस बदल दिया %repository%.",
      createEntityLink: "%actor% संबद्ध %child% साथ में %parent%.",
      removeEntityLink: "%actor% अलग %child% से %parent%.",
      createEntityRevision: "%actor% एक बनाया %revision% का %entity%.",
      checkoutRevision: "%actor% चेक औट %revision% में %repository%.",
      rejectRevision: "%actor% रद्द %revision% में %repository%।",
      createTaxonomyLink: "%actor% जोड़ा %child% से %parent%।",
      removeTaxonomyLink: "%actor% अलग %child% से %parent%।",
      createTaxonomyTerm: "%actor% बनाया था %object%।",
      setTaxonomyTerm: "%user% अद्ययावत %term%।",
      setTaxonomyParentDeleted: "%actor% के जनक को हटा दिया %child%।",
      setTaxonomyParentChangedFrom: "%actor% के पैरेंट को बदल दिया %child% से %previousparent% वहाँ %parent%",
      setTaxonomyParentChanged: "%actor% के पैरेंट को बदल दिया %child% वहाँ %parent%.",
      setUuidStateTrashed: "%actor% को खारिज किया %object%.",
      setUuidStateRestored: "%actor% बहाल %object%.",
      entityPlaceholderFallback: "सामग्री"
    },
    subscriptions: {
      mail: "ई-मेल",
      subscription: "सदस्यता",
      noMails: "निष्क्रिय करें ",
      noNotifications: "रद्द करें"
    },
    revisions: {
      checkout: {
        action: "स्वीकार करें ",
        title: "संशोधन स्वीकारें",
        explanation: "कृपया लेखक को कुछ प्रतिक्रिया दें"
      },
      reject: {
        action: "अस्वीकार करें",
        title: "संशोधन अस्वीकारें",
        explanation: "कृपया लेखक को बताएं कि आप सबमिशन को क्यों अस्वीकार कर रहे हैं।"
      },
      confirm: "पुष्टि करें"
    }
  }
};